{"config": [{"config": {"bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 784], "bias_constraint": null, "units": 128, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "use_bias": true, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 128, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 10, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}